# Taps 
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Brews (Packages/Formulae)
brew "bat"
brew "btop"
brew "bundletool"
brew "cmatrix"
brew "exa"
brew "fastlane"
brew "fd"
brew "fff"
brew "git-delta"
brew "git-flow"
brew "htop"
brew "httpie"
brew "lazygit"
brew "mint"
brew "neofetch"
brew "neovim"
brew "openjdk@17"
brew "ripgrep"
brew "fzf"
brew "spotify-tui"
brew "swiftlint"
brew "tree"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "powerlevel10k"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "tlrc"
brew "thefuck"
brew "glow"
brew "tmux"
brew "yazi"
brew "ffmpegthumbnailer"
brew "sevenzip"
brew "jq"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "imagemagick"
brew "spicetify-cli"

# Casks (Applications)
cask "brave-browser"
cask "appcleaner"
cask "charles"
cask "proxyman"
cask "alfred"
cask "1password"
cask "amethyst"
cask "obsidian"
cask "android-studio"
cask "clockify"
cask "fork"
cask "kitty"
cask "postman"
cask "rectangle"
cask "nikitabobko/tap/aerospace"
