atommaterial.a-file-icon-vscode
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
dautroc.yazi-vscode
davidanson.vscode-markdownlint
ecmel.vscode-html-css
esbenp.prettier-vscode
fr43nk.seito-openfile
github.copilot
github.copilot-chat
github.vscode-pull-request-github
htmlhint.vscode-htmlhint
illixion.vscode-vibrancy-continued
mads-hartmann.bash-ide-vscode
redguardtoo.matchit
redhat.vscode-yaml
saoudrizwan.claude-dev
sharat.vscode-brewfile
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
sumneko.lua
tamasfe.even-better-toml
tompollak.lazygit-vscode
vscjava.vscode-gradle
vscodevim.vim
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
zignd.html-css-class-completion
